---
kind: type
id: T:Autodesk.Revit.DB.FilterNumericLess
source: html/fcdb6568-9715-4292-e903-c73c0b54dd67.htm
---
# Autodesk.Revit.DB.FilterNumericLess

Tests whether numeric values from the document are less than a certain value

## Syntax (C#)
```csharp
public class FilterNumericLess : FilterNumericRuleEvaluator
```